[
  {
    "gossipId": 1,
    "content": "Saw Mayor Peterson sneaking out of the bakery at dawn carrying a giant box of red velvet cupcakes. Wonder who they were for?"
  },
  {
    "gossipId": 2,
    "content": "Rumor has it that Miss Beatrice, the librarian, is secretly a world-renowned cat whisperer. Apparently, she can make them do anything!"
  },
  {
    "gossipId": 3,
    "content": "  I overheard the twins from Elm Street talking about a hidden treasure stashed somewhere in the old abandoned mansion. Maybe there's truth to the local legends after all..."
  },
  {
    "gossipId": 4,
    "content": "The new chef at Luigi's Ristorante is rumored to be a former contestant on a famous cooking competition show! No wonder their pasta is so incredible."
  },
  {
    "gossipId": 5,
    "content": "Did you hear? The Parkers are putting their prize-winning poodle, Fifi, up for adoption! Apparently, they're getting a hypoallergenic hairless cat."
  },
  {
    "gossipId": 6,
    "content": "Caught Mr. Henderson from the flower shop talking to his plants this morning.  I swear I saw a rose bush nod back! Maybe he's onto something..."
  },
  {
    "gossipId": 7,
    "content": "Brenda at the bookstore claims she saw a ghost last night wandering the stacks!  Spooky! Especially since they were the history section..."
  },
  {
    "gossipId": 8,
    "content": "The annual bake-off is heating up!  Ms. Lee from across the street is rumored to be entering her famous blueberry pie recipe this year.  Looks like we have some tough competition!"
  },
  {
    "gossipId": 9,
    "content": "Spotted Charlie from the pet store walking a miniature pig down Main Street yesterday.  Apparently, they're offering a new exotic pet sitting service.  Intriguing!"
  },
  {
    "gossipId": 10,
    "content": "Big news!  The town council is considering building a new dog park on Maple Street.  Fido will be thrilled!"
  },  
  {
    "gossipId": 11,
    "content": "Have you seen that white powder? I heard that double the white powder works wonders",
    "ingredientId": 1,
    "potionId": 17
  },
  {
    "gossipId": 12,
    "content": "Did you know that Bain Marie is just Mary's bath water?",
    "ingredientId": null,
    "potionId": 17
  },
  {
    "gossipId": 13,
    "content": "Scandal at the Art Guild! The winner of the grand prize last year is rumored to have secretly traced their masterpiece.  Will they be stripped of their title?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 14,
    "content": "Oh, the scandal! The whole town is abuzz about the baker's apprentice and the blacksmith's wife! Apparently, their secret rendezvous in the mill shed got interrupted by a flock of very loud pigeons. Talk about a feathery fiasco!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 15,
    "content": "Looks like sparks are flying between Lady Esmeralda and that handsome visiting knight, Sir William! But not the good kind. Seems the Lady accused him of pilfering a jeweled comb!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 16,
    "content": "Heard it from the baker himself! King Roderick was spotted sneaking out at midnight to visit that creepy Potion Seller. ",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 17,
    "content": "The castle guards are whispering about a ghost spotted wandering the halls at night! Seems the poor soul can't find rest. Maybe someone needs to lay their spirit to peace?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 18,
    "content": "An alchemist has been spotted peddling strange concoctions in the marketplace.  But that alchemist's potions are weird? They all seem to grant a weird superpower rather than the usual potions.",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 19,
    "content": "The crows seem particularly bold lately, snatching trinkets and shiny baubles from unsuspecting townsfolk.  Is it just bird-brain behavior or a sign of something more...ominous?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 20,
    "content": "The town drunk swears he saw a group of gnomes cavorting beneath the full moon last night.  Given his usual state, most folks dismiss it.  But then again...",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 21,
    "content": "Do you sometimes feel like you're being watched",
    "ingredientId": null,
    "potionId": null
  }
]
  