[
  {
    "gossipId": 1,
    "content": "Pretty sure I saw that old Wizard guy dealing some kind of product behind the old mill."
  },
  {
    "gossipId": 2,
    "content": "Rumor has it that Miss Beatrice, the librarian, is secretly a world-renowned cat whisperer. Apparently, she can make them do anything!",
    "ingredientId": null,
    "potionId": 3
  },
  {
    "gossipId": 3,
    "content": "https://www.amazon.com/Lipton-Green-Bags-Mandarin-Orange/dp/B01LS2A2K6/ref=sr_1_5_pp?dib=eyJ2IjoiMSJ9.Dq-Le4dWeyWvLNLLGgDS1eY26RSqTjMH8iYPqk6kozvX54oOfN-TEg6LyWxpsq0mwMRilqMRdgM5PsqBt77Lodpr-nTadBqwT2-m9c1Q6aIjuKzKfJktUuE3mF1iaBHI8xvlqtE3W0mMtjrcG4rPmtARij5pcp4NcDsCj-jVV0E7Wle3khjbvh6Xzxwv4r9K_hJOHk3GgrkPrsQtsyBIoIcRl1OX0vYtWatbrcgzKF7AWaRYQ3mkSMt5sQXPocfRO1qHqWP-_NfafTprS3S713K_Oawmzuj_ZNVIAcWQBkc.a90SnIRL4fgasTJN1Ehm-GIFWPp4OG5u0wdbVH8yqoI&dib_tag=se&keywords=tea&qid=1713638493&sr=8-5"
  },
  {
    "gossipId": 4,
    "content": "The new chef at Luigi's Ristorante is rumored to be a former contestant on a famous cooking competition show! No wonder their pasta is so incredible."
  },
  {
    "gossipId": 5,
    "content": "You know that large, muscular guy that has 3 wives who lives in the east side of the village? I heard he wasn't always that way...He used to be a scrawny and ugly kid. Some say it's work of eating cheese and drinking some kind of a weird water...",
    "ingredientId": [6, 5],
    "potionId": 18
  },
  {
    "gossipId": 6,
    "content": "Caught Mr. Henderson from the flower shop talking to his plants this morning.  I swear I saw a rose bush nod back! Maybe he's onto something..."
  },
  {
    "gossipId": 7,
    "content": "You think that frog at the potion sellers house could be a prince? It seems pretty special."
  },
  {
    "gossipId": 8,
    "content": "I heard the potion seller makes some potions using a foot. Where do you even get this foot? Would you want to drink a foot potion even if it gave you cool powers?"
  },
  {
    "gossipId": 9,
    "content": "Nipesh drank a potion and stole the cookie."
  },
  {
    "gossipId": 10,
    "content": "I heard Sir Henry actually turned into a boiled egg..."
  },  
  {
    "gossipId": 11,
    "content": "Have you seen that white powder? I heard that double the white powder works wonders",
    "ingredientId": [1],
    "potionId": 17
  },
  {
    "gossipId": 12,
    "content": "Did you know that Bain Marie is just Mary's bath water?",
    "ingredientId": [5],
    "potionId": null
  },
  {
    "gossipId": 13,
    "content": "Have you heard, Sir Barry seem to gone missing? His wife Mrs Barry has already found a new husband. But everyday he seems to be slowly losing his health. I wonder if Mrs Barry's new husband is going to be alright.",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 14,
    "content": "Oh, the scandal! The whole town is abuzz about the baker's apprentice and the blacksmith's wife! Apparently, their secret rendezvous in the mill shed got interrupted by a flock of very loud pigeons. Talk about a feathery fiasco!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 15,
    "content": "Looks like sparks are flying between Lady Esmeralda and that handsome visiting knight, Sir William! But not the good kind...",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 16,
    "content": "Heard it from the baker himself! King Roderick was spotted sneaking out at midnight to visit that creepy Potion Seller. ",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 17,
    "content": "Ginger has so many health benefits, maybe I can mix it with something to make me fun faster",
    "ingredientId": [2],
    "potionId": 15
  },
  {
    "gossipId": 18,
    "content": "An alchemist has been spotted peddling strange concoctions in the marketplace.  But that alchemist's potions are weird? They all seem to grant a weird superpower rather than the usual potions.",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 19,
    "content": "The crows seem particularly bold lately. Is someone talking to them?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 20,
    "content": "The town drunk swears he saw a group of gnomes cavorting beneath the full moon last night.  Given his usual state, most folks dismiss it.  But then again...",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 21,
    "content": "Do you sometimes feel like you're being watched?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 22,
    "content": "Did you hear about Farmer John's story? He's gone mad! He has been begging the priest at the Church  to let him and Bess get married at the altar...Bess is a cow! I think he's lost his marbles after drinking his knee remedy...The apothecary was brought to the Church to be exorcised after he was found to be mixing grated Footskin and Eye Crust. What a devil!",
    "ingredientId": null,
    "potionId": 3
  },
  {
    "gossipId": 23,
    "content": "Rumor has it that Tom the Peep hasn't been spotted since the incident at the tavern last month...His tab hasn't been picked up yet so now his face is posted up on every wall of the village. Last thing we heard about him is that he was working on a potion made of a mysterious liquid and another key ingredient that has something to do with Goblins...",
    "ingredientId": null,
    "potionId": 4
  },
  {
    "gossipId": 24,
    "content": "The royal family is in shambles because the princess heir has been in hiding although she is to be wed to the neighboring kingdom's price heir. Rumor has it that the princess, who is a recovering alcoholic, went on a drinking spree and had a concoction from Ectoplasm and a Goblin product...I wonder why that mixture is so bad that it would force one into hiding?",
    "ingredientId": null,
    "potionId": 8
  },
  {
    "gossipId": 25,
    "content": "Word on the street is that Lady Agnes's prized pet frog has been feeling ill lately. Perhaps you could do something about it? You seem like you know a lot about frogs...",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 26,
    "content": "So Sir Henry suddenly grew a full beard, although everyone in the village knows he is bald as a boiled egg. We are growing suspicious of him thinking he made a deal with the devil, and one time the village people held him at pitchfork-point. He claims he just mixes a root crop with powder! What devilry is afoot!",
    "ingredientId": null,
    "potionId": 1
  },
  {
    "gossipId": 27,
    "content": "The lead singer at the church has improved a lot in singing lately, that she's making a lot of gold coins from busking at the town square! I asked her what the secret is, and she said she adds ginger with a little ingredient she won't tell me about...",
    "ingredientId": null,
    "potionId": 16
  },
  {
    "gossipId": 28,
    "content": "Have you seen the new blacksmith apprentice? The ladies of the village have been saying he looks charming! Rumor has it that he's actually a bastard son of the King from far away, and he was dumped into this village as an infant...But between you and me, I think he's the guy stealing people's goats since they've started to disappear right when he started living in this village...A pox upon it!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 29,
    "content": "Have you heard of the old Widow who lives by the dumps? I've heard she's brewing love potions lately, and the ladies of the village have been saying they're effective...No wonder the men of the village have been looking dead tired lately...Why aren't you selling love potions anyway?",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 30,
    "content": "I heard that you can take double dosage of the white powder and be able to do any work you always put off!",
    "ingredientId": null,
    "potionId": 17
  },
  {
    "gossipId": 31,
    "content": "Did you hear that the orc boy is actually the son of a deposed king and his beloved concubine? The kingdom had been discreet with the disposal of the boy and covering up his past, but he turned out to be a really smart guy with great qualities of a true leader, unlike his father.",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 32,
    "content": "You seen the scar on the red hood girl's neck? It was gashed by a band of thieves when she was held ransom at dagger-point at the town center. Little do the stupid thieves know that she used to be a street urchin and had her way with any physical altercations...The band of thieves had to pack up and leave for the next town due to embarrassment!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 33,
    "content": "That little old man always hanging by the docks claiming to be a fisherman...some say he's not what he seems to be.",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 34,
    "content": "Did you know you can combine two of the same ingredients together? My friend said she mixed a few of them and accidentally made prescription for confusion? Or was it a lamp juice that she made? Wait, no...It might have been something for earthquakes...",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 35,
    "content": "If you really need to push stuff out of your digestive system, mix white powder with cheese and you'll get a really potent laxative.",
    "ingredientId": null,
    "potionId": 10,
  },
  {
    "gossipId": 36,
    "content": "I know summer is coming so everyone is scrambling to get their 'summer body'...But let me tell you a trick since I think we're cool: Mix cheese with a little bit of water. You'll look better. Hey, you can even mix this with some macaroni and it's just Mac n Cheese!",
    "ingredientId": null,
    "potionId": 18
  },
  {
    "gossipId": 37,
    "content": "I heard that ginger tea can not only relax your vocal cords and thereby expanding your vocal range, it can also make the throat pocket of amphibian's enlarge like crazy!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 38,
    "content": "The blonde kid running around with a bowl of oatmeal. Apparently she's a thief! Don't judge people based on their looks and never trust a stranger, no matter how innocent they seem!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 39,
    "content": "I received 3 gold coins, so here's your palm reading: Chase love and it will hide away from you! Ignore it and it will find its way to you!",
    "ingredientId": null,
    "potionId": null
  },
  {
    "gossipId": 40,
    "content": "A glow up tip for you: Bald is okay...Haired is also okay...Somewhere in between is NOT okay.",
    "ingredientId": null,
    "potionId": null
  }
]
  