[
    {
      "questId": 1,
      "questGiver" :"Traveler Knight",
      "content": "Hello Potion Seller, I am going into battle and I want your strongest potions. Potion Seller, I tell you I am going into battle, and I want only your strongest potions.",
      "imageUrl": "",
      "questGiverId": 1,
      "stories": [
        {
          "potionId": 1,
          "story": "The knight proudly consumed the potion and immediately after hair started growing magnificently out of his chin forming a luscious beard. Unfortunately, the knight, still not used to his new locks, charged recklessly into battle, the beard getting tangled in their armor and snared on other people's armor. Word spread of the knight who tripped over his own beard, and soon every barber shop was filled with people asking for shorter beard styles.",
          "rating": 2,
          "reveal": true,
          "revealText": "Traveler knight consumed this potion and started growing a magnificent beard."
        },
        {
          "potionId": 2,
          "story": "The knight drank the potion and immediately let out a perfect replica of the enemy's battle cries. Their loud cry rallied the enemy forces and gave away his own position. They quickly charged and poopy-di scoop scoop-diddy whoop whoop-di-scoop-di-poop poop-di-scoopty scoopty-whoop whoopity-scoop, whoop-poop poop-diddy, whoop-scoop poop, poop scoop-diddy-whoop whoop-diddy-scoopy whoop-diddy-scoop, poop",
          "rating": 2,
          "reveal": true,
          "revealText": "The traveling knight got beat up when he used this potion and was able to imitate another person perfectly. But watching the knight get poopity-scooped gave you the idea that maybe this potion could open the doors to a successful rap career if you choose to go down that road."
        },
        {
          "potionId": 3,
          "story": "The knight drank the potion and suddenly he could understand the birds chirping in the forest. They were gossiping about the enemy's battle plans. However, the knight, not being very smart, couldn't keep up with the speed of the gossip and kept getting lost in all the side tangents in the stories. Eventually he wandered straight into the enemy army's camp clutching his head like a duck with a headache.",
          "rating": 1,
          "reveal": true,
          "revealText": "When someone says to you 'a little bird told me' this potion helped them understand the little bird."
        },
        {
          "potionId": 4,
          "story": "Potion seller. I went face my demons armed with your strongest potion. I stared at them with my most ferocious stare and drank the potion, never breaking eye contact. Well, they weren't really looking at me, but I was looking at them. And I didn't blink. However, drinking the potion just made them ignore me better. The potion turned me invisible! All my toes got trampled.",
          "rating": 1,
          "reveal": true,
          "revealText": "There was a traveling knight that made me realize that some people just seem to blend into the background naturally, but for the others, this potion should turn them invisible."
        },
        {
          "potionId": 5,
          "story": "You tried to watch the knight through your glass ball, but it seemed you were a little late in tuning in and the knight had already drank the potion. Currently your crystal ball was just showing you clouds billowing around no matter how hard to tried to get a clearer picture. You're not really sure what this is about or why your ball was so cloudy.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 6,
          "story": "When you used your crystal ball to check how the knight was doing after drinking the potion you were just greeted with a black void. Did your crystal ball get unplugged? But your crystal ball doesn't use electricity. And there is no electricity here. The more you think, the more your head gets filled with confusing thoughts. Bedge time, you think.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 7,
          "story": "The knight drank the potion and immediately felt power surging through his legs. 'ONCE A BANDLE GUNNER, ALWAYS A BANDLE GUNNER!' he yelled as the knight catapulted in like a big rock. However, the knight, clearly lacking in foresight, landed right in the middle of the enemy formation, surrounded and overwhelmed.",
          "rating": 1,
          "reveal": true,
          "revealText": "Seems like this potion may make people prone to sending it with a big jump"
        },
        {
          "potionId": 8,
          "story": "The knight drank the potion, and it seemed nothing had happened. He looked the same as ever, clad head to toe in armor like he might have been compensating for something. After a bit longer of seeing no change, you left to go eat some food.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 9,
          "story": "The knight drank the potion and immediately his eyes began darting around. 'The trees' he said 'the trees are speaking'.  This fact seemed to really mess with the knights brain. You're not sure if his sanity will come back.",
          "rating": 1,
          "reveal": true,
          "revealText": "The trees will speak apparently"
        },
        { 
          "potionId": 10,
          "story": "I told this traveler 'my potions are too strong for you'. I had warned him, 'my strongest potions are only for the strongest and you clearly are not of the strongest, you're clearly the weakest'. I can give any potion, but if one does not have the mind or fortitude to use them, the potions will not help. This traveler took my potion and let out a fart so large and so powerful that he imploded in on himself and must have teleported to a new dimension or something. I will give myself a 3 star rating for teaching such a valuable lesson.",
          "rating": 3,
          "reveal": true,
          "revealText": "This potion is my pride and joy. A super large fart."
        },
        {
          "potionId": 11,
          "story": "The knight took the potion and immediately a stain began forming under his feet. As the knight walked around the stain spread to where ever he walked. As the knight approached the long awaited battle, the enemies quickly realize this quirk from their opponent. Seeing this they quickly changed their battle plan and started luring the knight along a very peculiar path. By the end of the battle, there seemed to be a cryptic message left on the battlefield. The potion seller needed to zoom out on his crystal ball to see the full message: 'send beautiful renaissance painting' it said.",
          "rating": 1,
          "reveal": true,
          "revealText": "Can use human as paintbrush to write messages or draw with this potion"
        },
        {
          "potionId": 12,
          "story": "The knight took the potion and waved his arms around. The knight was acting strange, but you couldn't really tell anything too different about him.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 13,
          "story": "As he stood in front of the enemy, the knight drank the potion and was immediately compelled to yell 'YO MAMA' at the top of his lungs. As he bellow the ground shook forming an earthquake that shook everyone. It felt like something with a very large mass had hit the ground. After the ground stopped shaking the enemy quipped back 'I know you are, but what am I'. It didn't make much sense to you, but the knight seemed devastated",
          "rating": 1,
          "reveal": "The knight said Yo mama makes a big earthquake"
        },
        {
          "potionId": 14,
          "story": "After drinking the potion, the knight held his hands up and with the powers of the potion summoned a giant sandstorm. The stupid sandstorm made the visibility so bad, so you couldn't see what else happened but at least you knew that this potion gave the power to summon sandstorms. And despite the low visibility, you could safely assume that the knight was not succeeding in fighting his battle. He always seemed to be a failure.",
          "rating": 1,
          "reveal": true,
          "revealText": "The knight used this to summon an earthquake"
        },
        {
          "potionId": 15,
          "story": "After taking the potion, the knight seemed to just start tripping over himself. Maybe his suit of armor was limiting his movements? You could tell that your potion was doing something, but what exactly you weren't sure.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 16,
          "story": "The Gluglug Juice caused the knight to shrink down to a tiny size. They snuck into the enemy camp unnoticed but were then promptly stepped on by a giant enemy soldier.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 17,
          "story": "The knight drank the potion and let out a shrill something that made your ears bleed. You could not keep watching for the health of your auditory channels. With your hands over your ears you left the room and the crystal ball as quickly and you could.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 18,
          "story": "The knight took the potion and maybe seemed to grow taller? You couldn't really tell from this angle. The suit of armor was also making it difficult to see anything.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 19,
          "story": "The knight drank the potion and was immediately buried by a bunch of rocks. The potion definitely had something to do with rocks, but this knight didn't seem to be a very good test subject for this potion.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 20,
          "story": "The knight drank the potion and used his hands to summon a ball of light. And then he just looked at the light, like a moth to a flame or a moth to a light. This knight might as well be a moth.",
          "rating": 1,
          "reveal": true,
          "revealText": "The knight was drawn to the summoned ball of light like a moth to a ball of light"
        }
      ],
      "defaultMessage": "The battle raged on, a cacophony of clashing steel and desperate cries. The knight, though well-equipped with potions, lacked the wit to use them effectively. The outcome of the battle hangs in the balance."
    },
    {
      "questId": 2,
      "questGiver" :"The frustrated fisherman",
      "content": "There's something haunting the graveyard by the pond that I like to fish in. Every time I go fishing now, I keep catching boots. It's the same old soggy boot, always the left shoe. I can't escape it and I can't catch any fish. Please give me a super power to escape this boot curse.",
      "imageUrl": "",
      "questGiverId": 2,
      "stories": [
        {
          "potionId": 1,
          "story": "The fisherman eagerly consumed the strange concoction. A beard quickly grew out from his face. The beard really helped the fisherman look more like a fisherman. It bothered you that the fisherman didn't look the part, so you considered this change to be a success.",
          "rating": 1,
          "reveal": true,
          "revealText": "Fishermen and fisherwomen look like they catch more fish with beard and this potion helps with that."
        },
        {
          "potionId": 2,
          "story": "The fisherman, desperate at this point, gulped down the dubious potion. The seller mentioned mimicking sounds, so the fisherman tried to mimic a spooky groan. It came out more like a strangled cat. A crow landed nearby and cawed mockingly. The boot remained firmly attached.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 3,
          "story": "The fisherman clutched at straws and drank the potion. The seller mumbled something about languages. The fisherman hoped it would help him understand the ghostly moans from the graveyard. He heard a mournful cry, but it wasn't about boots. He reeled in... yep, another soggy boot.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 4,
          "story": "The fisherman downed the potion, unsure what invisibility would do for his boot problem. He cast his line, feeling a tug. He reeled in... his own hat? It seems invisible now, but the boot was firmly hooked, mocking him from the water.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 5,
          "story": "The fisherman drank the potion, the seller mentioning something about soaring. He envisioned himself flying high above the haunted pond, finally free of the boot. He took flight, only to realize he couldn't cast a line from up there. He landed with a splash, the boot greeting him at the water's surface.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 6,
          "story": "The fisherman consumed the potion, the seller mentioning something about crafting materials. He figured, why not? Maybe a bridge across the pond would help him escape. He ended up with a small, wobbly hillock in the middle of the water. The boot? Still there, judging him from the depths.",
          "rating": 1,  
          "reveal": false
        },
        {
          "potionId": 7,
          "story": "The fisherman drank the potion, the seller mentioning some vague notion of jumping. He figured super jumps might help him escape the haunted water. He bounced uncontrollably around the pond like a deranged pogo stick. The boot remained stubbornly hooked, a constant reminder of his curse.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 8,
          "story": "The fisherman took a swig of the murky potion, the seller mentioning a powerful boom. He braced himself for a mighty thunderclap to scare away the ghost. Instead, a tiny puff of smoke emerged. The ghost, barely noticing, sent another boot his way.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 9,
          "story": "The fisherman drank the potion, the seller mentioning something about talking to plants. The fisherman, desperate at this point, tried to commune with the pond weeds. He learned a fascinating fact about algae reproduction, but the boot remained firmly attached to his line.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 10,
          "story": "The fisherman downed the potion, the seller mentioning powerful winds. He figured a strong gust might blow the boot away. He let out a mighty toot, only to succeed in blowing his hat off. The boot, ever present, awaited him on the other end of the line.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 11,
          "story": "The fisherman drank the potion, the seller muttering something about trails. The fisherman wasn't sure what good a trail would do, but he was willing to try anything. He cast his line and reeled in, leaving a sticky trail behind him. He ended up stuck fast to the ground, a human fly trap. The boot, ever opportunistic, landed right beside him.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 12,
          "story": "The fisherman eyed the potion with suspicion. He drank the potion, his knuckles cracked, and his fingers began glowing brightly. He cast his line, illuminating the murky depths. The source of the curse was revealed! A grumpy spectral washerwoman was churning out an endless supply of left boots in her underwater washing machine. The fisherman, armed with knowledge, finally knew what he had to do.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 13,
          "story": "The fisherman chugged the dubious concoction, the seller mentioning something about earthquakes. The fisherman wasn't sure how an earthquake would help, but he cast his line anyway. The pond rippled violently, causing him to lose his balance and fall in. He sputtered to the surface, the boot clinging to his line like a leech. The ghost from the graveyard, startled by the commotion, looked down and shrieked. Distracted, she tripped and fell into her own washing machine, vanishing in a puff of steam. The curse was broken, but the fisherman was left shivering and sopping wet, with a boot and a newfound appreciation for a calm pond.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 14,
          "story": "The fisherman drank the potion, the seller mentioning something about insults. The fisherman wasn't sure how insults would help his predicament, but he was willing to try anything at this point. He reeled in his line and yelled a string of insults at the boot. The water around him bubbled ominously, and a giant spectral hand emerged, holding another left boot. The curse had doubled! The fisherman fainted dead away.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 15,
          "story": "The fisherman downed the potion with trepidation. He felt a surge of energy and nimbleness course through him. He danced around the pond with newfound grace, effortlessly dodging the spectral boot after spectral boot that the ghost hurled at him. However, his triumph was short-lived. The ghost, impressed by his agility, decided to keep him forever young and spry, forcing him to dance around the haunted pond for eternity.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 16,
          "story": "The fisherman eyed the potion nervously. The seller, with a Cheshire grin, mentioned shrinking. The fisherman wasn't sure how shrinking would help, but he was desperate. He drank the potion and felt himself shrinking rapidly. He cast his line, and the boot loomed over him like a skyscraper. Panicked, he tried to hide under a pebble, but the spectral washerwoman scooped him up and tossed him into her washing machine with the endless supply of left boots. The fisherman was never seen again.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 17,
          "story": "The fisherman warily drank the potion. The seller mentioned something about invisibility. The fisherman wasn't sure how invisibility would help with a rogue boot, but he cast his line anyway. He became invisible, chuckling to himself that the ghost wouldn't be able to find him. However, he forgot he was invisible and reeled in his own fishing line, wrapping himself up like a cocoon and tumbling into the pond. The boot, ever persistent, landed on his head.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 18,
          "story": "The fisherman eyed the brightly colored potion with suspicion. The seller, rambling incoherently, mentioned something about handsomeness. The fisherman wasn't sure how looking good would help with his boot problem, but he was at his wit's end. He drank the potion and admired his reflection in the pond. Suddenly, a chorus of sighs rose from the graveyard. The ghosts, all lovelorn and distracted, forgot about the fisherman entirely. He sheepishly reeled in his line... and of course, the boot was still there. But at least he had a captive audience for his fish tales, if he ever managed to catch any.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 19,
          "story": "The fisherman, desperate for a solution, drank the potion and envisioned a powerful blast of water to dislodge the boot. Instead, he accidentally summoned a crackling bolt of lightning as well as a big tidal wave. The ghost hiding by the graveyard was startled by a sudden thunderclap that echoed through the surroundings. Dazed and confused, she momentarily forgot about the boot. The fisherman reeled in his line... and the boot was still there. But at least he had the ghost's attention now.",
          "rating": 2,
          "reveal": true,
          "potionName": "Elemental Vial"
        },
        {
          "potionId": 20,
          "story": "The fisherman, with a sigh, drank the last potion. He drank the potion and a ball of light materialized at the tip of his fishing rod. He cast his line, the illuminated bobber attracting a school of fish for the first time. He reeled in a whopper, finally he didn't catch a boot. The ghost peeked over the gravestone, confused and defeated. The fisherman now had a new reliable way of catching fish. He didn't need the boot anymore, so he decided to give it to you as a token of his appreciation.",
          "rating": 3,
          "reveal": true,
          "potionName": "St. Elmo's Tonic",
          "rewardItem": "boot.png",
          "rewardText": "You have received a soggy old boot. You'll find some place for this boot in your cabin."
        }
      ],
      "defaultMessage": "The fisherman never got back to you about how the potion worked. Oh well, maybe he'll go seeking you out for the solution again."
    },
    {
      "questId": 3,
      "questGiver" :"The Nervous Escort",
      "content": "I've been told to escort Escia to Tobbek tomorrow, and I am so nervous. I need this mission to be a success, so I can make a good impression on Escia. Please give me a power that will guarantee this mission's success.",
      "imageUrl": "",
      "questGiverId": 3,
      "stories": [
        {
          "potionId": 1,
          "story": "Desperate for success, the escort downed the potion. Overnight, a thick beard sprouted on their face.  The journey was unexpectedly peaceful until a band of ogres ambushed them.  The escort, surprised but emboldened by their new beard, roared a challenge.  Startled by the unexpected ferocity, the ogres hesitated, giving the escort enough time to unleash a flurry of blows, sending them fleeing.",
          "rating": 2,
          "reveal": true
        },
        {
          "potionId": 2,
          "story": "The first day of the travels was uneventful. On the second day, a pack of goblins ambushed them.  The escort, mimicking a particularly loud and obnoxious goblin leader, sowed confusion among the attackers.  Taking advantage of the chaos, the escort fought their way through the goblins, escaping unharmed.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 3,
          "story": "Hoping to anticipate dangers, the escort chugged the potion. They learned of a hidden bandit camp ahead.  Using their newfound knowledge, the escort devised a daring plan.  They snuck past the perimeter guards, mimicking the calls of a nocturnal bird to distract the lookouts.  Inside the camp, the escort freed the prisoners and sparked a rebellion.  The bandits were overwhelmed, and the camp was liberated.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 4,
          "story": "Dreaming of a smooth journey, the escort downed Tom's Potion. They turned invisible!  Disaster struck when a monstrous griffin swooped down, mistaking the escort for a tasty morsel.  The escort, invisible, had to dodge razor-sharp talons and fight back blindly.  Just as the griffin prepared for a final strike, the potion's effect wore off, revealing the escort.  The griffin, surprised, faltered for a moment, giving the escort the opening they needed to deliver a fatal blow.  They arrived in Tobbek, exhausted but victorious.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 5,
          "story": "Dreaming of a swift journey, the escort drank the Potion of Flight.  Soaring through the air, they spotted a column of smoke rising in the distance.  Investigating, they found a village under attack by a fire-breathing dragon.  The escort, without hesitation, swooped down and engaged the beast in a fierce aerial battle.  Dodging flames and scorching winds, the escort managed to slay the dragon, saving the village.  They landed in Tobbek a hero, their wings singed but their spirit unbroken.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 6,
          "story": "Hoping to impress, the escort consumed the Matter potion. The journey was smooth, with the escort shaping bridges and clearing paths.  Then, the earth trembled violently.  A monstrous earthworm, awakened by the magic, erupted from the ground.  The escort, thinking fast, used their power to reshape the landscape, creating a series of trenches and earthworks to trap the beast.  In a grueling battle, the escort used their environment to their advantage, finally defeating the earthworm and ensuring the safety of the region.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 8,
          "story": "Hoping for a clean and easy journey, the escort drank a strange potion. They were startled by a sudden thunderclap that echoed through the surroundings.  Looking down, they realized the potion had caused them to lose all their hair!  Escia, initially surprised, found their bald head oddly endearing.  Despite the embarrassing situation, the journey continued, and the escort arrived in Tobbek, a little self-conscious but determined to complete the mission.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 9,
          "story": "The escort, yearning to understand the wilderness, drank the potion. They spent the journey conversing with the local wildlife, learning about hidden dangers and forgotten paths.  One day, they encountered a distressed herd of deer fleeing in terror.  Following their tracks, the escort discovered a group of monstrous wolves attacking a hidden village.  The escort, using their newfound ability to communicate with animals, rallied the deer and other forest creatures to defend the village.  In a fierce battle, the beasts drove back the wolves, saving the villagers.  The escort arrived in Tobbek, a protector of nature with a newfound respect for the power of communication.",
          "rating": 3,
          "reveal": false,
          "rewardItem": "antler",
          "rewardText": "antler.png"
        },
        {
          "potionId": 10,
          "story": "Hoping to lighten the mood, the escort drank a strange potion. The potion caused them to develop incredibly strong flatulence.  At first, Escia tried to be cordial and understanding about the constant farts, but the constant barrage of smelly blasts quickly became overwhelming.  The journey was disrupted as the escort struggled to control their emissions, and they became a prisoner of the journey.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 11,
          "story": "Hoping to avoid detection by bandits, the escort drank a strange potion.  The potion caused them to leave behind a trail of sticky goo wherever they sat.  The journey was messy, with the escort constantly sticking to rocks, logs, and even Escia's saddle.  They managed to avoid bandits, but arrived in Tobbek looking like a disaster and smelling faintly of berries.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 12,
          "story": "Hoping to appear confident and strong, the escort drank a strange potion. The potion caused their knuckles to crackle with glowing light whenever they flexed.  Escia found the glowing hands a bit strange, but the display of power was somewhat reassuring.  The journey was uneventful, and the escort arrived in Tobbek with glowing knuckles and a newfound sense of self-assurance.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 13,
          "story": "Hoping to clear a path through any obstacles, the escort drank a strange potion. The ground rumbled ominously, and Escia clung to her horse in fear.  Thankfully, there were no obstacles on the path, but the constant tremors made the journey miserable.  The escort arrived in Tobbek, covered in dust and thoroughly shaken, having achieved nothing but a bumpy ride.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 14,
          "story": "Hoping to create a diversion if needed, the escort drank a strange potion. A swirling sandstorm erupted around them, blinding and disorienting.  Escia became separated from the escort in the chaos, and they spent a frantic hour searching for each other.  The storm eventually subsided, and they were lucky to reunite.  The journey was delayed, and they arrived in Tobbek exhausted and frustrated.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 15,
          "story": "Hoping to impress Escia with their skills, the escort drank a strange potion. They felt a surge of energy and performed a series of acrobatic feats, much to Escia's amusement.  However, their newfound agility proved useless on the journey.  The escort arrived in Tobbek, slightly out of breath and covered in dirt, having achieved nothing but a brief display of acrobatics.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 16,
          "story": "Hoping to impress Escia with their skills, the escort drank a strange potion. The escort suddenly decided to be a bard and sang his heart out hitting high notes he could never dream of hitting before.  Initially everyone was impressed with his new vocal range, but it soon became clear that high notes did not equate to greater vocal ability and word spread of a traveling shrieker.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 17,
          "story": "Hoping to impress Escia with their skills, the escort drank a strange potion. They fixated on the wheels of the caravan and nobody could get the escort's attention back.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 18,
          "story": "The escort drank a strange potion and immediately became the most muscular and handsome person. Escia fell for him immediately. Later on the escort wrote a letter to you thanking you for his newfound beauty, muscles and face. Attached to his letter was a rose.",
          "rating": 3,
          "reveal": true,
          "rewardItem": "rose.png",
          "rewardText": "You received a Rose from the escort. You think that maybe their beauty may have gone to their head. You're not the biggest fan of roses, but you'll find a place to keep the rose."
        },
        {
          "potionId": 19,
          "story": "Hoping to overcome any obstacles with a touch of magic, the escort drank a strange potion that granted them incredible power to control the elements. The potion coursed through their veins, granting them incredible power over the elements. However, controlling the power proved difficult. The escort accidentally uprooted a tree while trying to swat a fly with a gust of wind, and tripped over their own feet while attempting to manipulate the earth to form a path. Escia, initially impressed, quickly became concerned about the escort's safety and clumsiness. The escort arrived in Tobbek exhausted and sore, having achieved nothing but a spectacular display of uncontrolled elemental chaos",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 20,
          "story": "The escort drank the potion and there was a ball of light. Nice.",
          "rating": 3,
          "reveal": false
        }

      ],
      "defaultMessage": "You didn't get any news from the escort. Maybe he'll come to you again with his problems and you can find out more."
    },
    {
      "questId": 4,
      "questGiver" :"The worried villager",
      "content": "My prized possession, a golden locket that's been in my family for generations, has gone missing! I believe a mischievous sprite has taken it and hidden it somewhere in the forest. Please help me find it!",
      "imageUrl": "",
      "questGiverId": 3,
      "stories": [  
        {
          "potionId": 1,
          "story": "The villager eagerly consumed the strange concoction. They felt a surge of strength coursing through their veins and set off into the forest, determined to find the locket. Their newfound strength allowed them to break through tangled undergrowth and climb trees with ease. Exhausted but determined, they eventually stumbled upon a hidden grove deep within the forest. There, perched on a glowing mushroom, sat the mischievous sprite, fiddling with the golden locket! The villager, empowered by the potion, surprised the sprite and retrieved the locket. Relief washed over them as they clutched their family heirloom.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 2,
          
          "story": "The villager, desperate at this point, gulped down the dubious potion.  They attempted to mimic the chirping of a bird, hoping to attract the sprite's attention. Instead, a flock of crows squawked mockingly from a nearby branch. The locket remained hidden.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 3,
          "story": "The villager clutched at straws and drank the potion. The potion empowered them to understand the whispers of the forest. They heard the rustling of leaves and the chattering of squirrels. One particularly talkative squirrel mentioned a hidden clearing guarded by a riddle. The villager, following the squirrel's cryptic clue, ventured deeper into the forest and eventually found the clearing. There, nestled amongst the ferns, was the golden locket! The villager, grateful to the talkative squirrel, retrieved the locket and emerged from the forest victorious.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 4,
          "story": "The villager downed the potion, unsure what invisibility would do for their missing locket. They ventured deeper into the forest, hoping to catch the sprite by surprise. They emerged on the other side, invisible but empty-handed. The locket was nowhere to be found.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 5,
          "story": "The villager drank the potion, the potion granting them the ability to soar high above the trees. From their aerial vantage point, they spotted a glint of gold amongst the trees. The villager swooped down and retrieved the hidden locket from a hollowed-out log. Soaring through the sky, the villager whooped with joy, relieved to have found their missing treasure.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 6,
          "story": "The villager consumed the potion, the potion granting them the ability to craft materials. They figured, why not? Perhaps a bridge across the stream would help them reach an unexplored area. They ended up with a small, wobbly bridge that led nowhere new. The locket remained missing.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 7,
          "story": "The villager drank the potion, the potion granting them super jumps. They bounced uncontrollably around the trees, knocking over a few birds' nests in the process. The locket hunt, however, remained unsuccessful.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 8,
          "story": "The villager took a swig of the potion, expecting a mighty thunderclap to scare the sprite out of hiding. Instead, a tiny puff of smoke emerged from the potion bottle. The forest remained silent, and the locket remained missing.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 9,
          "story": "The villager drank the potion, hoping to commune with the forest flowers. They learned a fascinating fact about the history of photosynthesis, but the locket was nowhere to be found.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 10,
          "story": "The villager downed the potion, hoping a strong gust might blow the locket out of its hiding place. They let out a mighty sneeze, only to succeed in blowing their hair into a frenzy. The locket remained stubbornly hidden. Discouraged, the villager slumped against a tree, the useless potion bottle clattering to the ground. As they sat there, a glint of gold caught their eye. Nestled amongst the roots of the tree was the very locket they'd been searching for! Relief washed over them as they realized sometimes the answer is right under your nose, with no magical potions required.",
          "rating": 2,
          "reveal": true
        },
        {
          "potionId": 11,
          "story": "The villager downed the potion. A mischievous glint entered their eye as they realized the potential of this peculiar concoction. They began weaving a path through the forest, leaving behind a vibrant trail of shimmering blue. Since they were leaving behind a trail, they were no longer getting lost. Finally, they spotted it: a single, perfect blue circle amidst a cluster of ordinary green stains.  Digging beneath the circle, the villager unearthed the golden locket, gleaming in the dappled sunlight. The potion, while unexpected, had proven its worth",
          "rating": 2,
          "reveal": true
        },
        {
          "potionId": 12,
          "story": "The villager, ever hopeful, downed the next potion. They cracked their knuckles and their fingers illuminated the path ahead.  However, their knuckles emitted a faint, sickly green glow that did little to dispel the forest's shadows.  The startled forest creatures, however, seemed to find the glowing knuckles highly offensive.  A barrage of pinecones rained down upon the villager, forcing them to flee back to the village with nothing but bruised shins and a throbbing headache.",
          "rating": 2,
          "reveal": true
        },
        {
          "potionId": 13,
          "story": "With a deep breath, the villager drank the dubious concoction. The ground trembled slightly, but the locket remained frustratingly hidden. Discouraged, the villager slumped against a tree, wondering if any of these potions would actually be useful.",
          "rating": 2,
          "reveal": true
        },
        {
          "potionId": 14,
          "story": "The villager, desperate at this point, downed the potion.  A sandstorm to magically appeared and scoured the forest floor. Staring at the sand dunes that had now formed, the villager was even more hopeless.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 15,
          "story": "The villager zipped around from place to place, but could not find anything.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 16,
          "story": "The villager, with a hint of skepticism, drank the potion.  They cleared their throat and belted out a high-pitched note, hoping to impress any nearby sprites with their newfound vocal range.  A flock of startled birds scattered from the trees, but other than that, there was no reaction. The villager's singing voice remained as average as ever.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 17,
          "story": "The villager grasped the vial.  They uncorked it and downed the shimmering liquid with a determined gulp.  Instantly, their mind sharpened.  Details of the forest floor, once blurred, became clear.  They noticed faint animal tracks leading deeper into the woods and subtle changes in the air current, hinting at a hidden entrance.  Following these clues with laser focus, the villager discovered a concealed passage beneath a gnarled tree root.  Crawling through the passage, they emerged into a hidden cavern where the mischievous sprite frolicked, the golden locket dangling from its tiny claw.  Empowered by the potion, the villager devised a clever plan to retrieve the locket, outsmarted the sprite, and emerged victorious.",
          "rating": 1,
          "reveal": true
        },
        {
          "potionId": 18,
          "story": "With a hint of trepidation, the villager uncorked the potion. They took a swig, bracing themselves for the change.  A surge of energy coursed through their veins, and their muscles bulged beneath their clothes.  They felt stronger, faster, and more confident than ever before.  Venturing deeper into the forest, the villager effortlessly scaled trees, leaped over streams, and navigated dense undergrowth with newfound ease.  They eventually tracked down the sprite, who was no match for the villager's newfound strength.  With a gentle nudge, the sprite surrendered the locket, impressed by the villager's manliness.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 19,
          "story": "The villager felt in-tune with the element of air.  With a whispered command, a gentle breeze swept through the forest, carrying with it the faint sound of tinkling laughter.  Following the sound, the villager located the sprite perched on a high branch, the locket clutched in its tiny hand.  Focusing on the element of wind once more, the villager summoned a gentle gust that lifted them effortlessly into the air.  They retrieved the locket from the surprised sprite and safely descended back to the forest floor.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 20,
          "story": "They uncorked the vial and downed the potion.  Raising their hand towards the sky, they concentrated, picturing a warm, glowing orb.  A ball of light materialized above their palm, illuminating the forest path with an ethereal glow.  The light revealed a series of cryptic symbols carved into the bark of a nearby tree.  Remembering a childhood fascination with ancient languages, the villager deciphered the symbols, leading them to a hidden hollow within the tree trunk.  Inside, nestled amongst soft moss, lay the missing locket.",
          "rating": 3,
          "reveal": true
        }
      ],
      "defaultMessage": "Default failure message",
      "rewardItems": "trophy",
      "rewardText": "you received a trophy"
    },
    {
      "questId": 5,
      "questGiver": "The Wise Wizard",
      "questGiverId": 2,
      "content": "Oh great potion seller, I seek your aid in retrieving the Magic Crystal from the Cave of Wonders. Can you provide me with a potion that will aid me in this perilous journey?",
      "stories": [
        {
          "potionId": 1,
          "story": "The brave adventurer consumed the Elixir of Hypertrichosis and delved into the cave. With a majestic beard, they commanded respect from the cave dwellers and retrieved the Crystal.",
          "rating": 3,
          "reveal": true
        },
        {
          "potionId": 2,
          "story": "The Mimicry potion allowed the adventurer to mimic the growls of a cave lion, scaring away smaller creatures and clearing a path to the Crystal chamber.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 3,
          "story": "Begone Babel granted the adventurer the ability to speak with the cave's wise old badger. The badger revealed the location of a secret passage leading directly to the Crystal.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 4,
          "story": "Tom's Potion rendered the adventurer invisible, allowing them to sneak past the cave's many guardians and reach the Crystal undetected.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 5,
          "story": "The Potion of Flight allowed the adventurer to soar above the treacherous cave passages and reach the Crystal chamber with ease.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 6,
          "story": "The Matter potion granted the adventurer the power to create a bridge across a chasm, allowing them to safely reach the Crystal chamber.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 7,
          "story": "Boinkie Toinkie granted the adventurer super high jumps, allowing them to navigate the cave's many vertical challenges and reach the Crystal.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 8,
          "story": "The Alopecic Panacea caused a sudden thunderclap, startling the cave guardians and giving the adventurer an opportunity to snatch the Crystal and escape.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 9,
          "story": "The Plant Whisperer potion allowed the adventurer to communicate with the cave moss, which revealed a secret pathway leading directly to the Crystal.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 10,
          "story": "The Elixir of Strong Flatulence caused a commotion within the cave, distracting the guardians and allowing the adventurer to grab the Crystal and flee.",
          "rating": 2,
          "reveal": false
        },
        {
          "potionId": 11,
          "story": "The Snail's Trail potion left a sticky trail wherever the adventurer went, making it impossible to escape the pursuing cave guardians.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 12,
          "story": "The Solar Hands potion illuminated the path ahead, revealing hidden dangers and allowing the adventurer to navigate the cave safely and reach the Crystal.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 13,
          "story": "Yo Mama caused a minor earthquake, collapsing a section of the cave and blocking the entrance. The adventurer was forced to abandon their quest for the Crystal.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 14,
          "story": "The Rude potion caused a sandstorm within the cave, burying the Crystal and forcing the adventurer to flee.",
          "rating": 1,
          "reveal": false
        },
        {
          "potionId": 15,
          "story": "Ninja Matcha granted the adventurer agility and stealth, allowing them to navigate the cave's perilous traps and reach the Crystal undetected.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 16,
          "story": "The Gluglug Juice caused the adventurer to shrink down to a tiny size, allowing them to slip through narrow passages and reach the Crystal chamber.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 17,
          "story": "The Invisibility Cloak potion rendered the adventurer completely invisible, allowing them to bypass the cave's many guardians and retrieve the Crystal with ease.",
          "rating": 3,
          "reveal": false
        },
        {
          "potionId": 18,
          "story": "The Jojo Juice turned the adventurer into a super buff and handsome person, but alas, the Crystal remained hidden within the heavily guarded chamber.",
          "rating": 1,
          "reveal": false
        }
      ]
    }
]
